#pragma once

#define NET_FRAMES_BACKUP	128		// must be power of 2
#define NET_FRAMES_MASK		(NET_FRAMES_BACKUP-1)

class INetChannel {
public:
	enum {
		GENERIC = 0,	// must be first and is default group
		LOCALPLAYER,	// bytes for local player entity update
		OTHERPLAYERS,	// bytes for other players update
		ENTITIES,		// all other entity bytes
		SOUNDS,			// game sounds
		EVENTS,			// event messages
		TEMPENTS,		// temp entities
		USERMESSAGES,	// user messages
		ENTMESSAGES,	// entity messages
		VOICE,			// voice data
		STRINGTABLE,	// a stringtable update
		MOVE,			// client move cmds
		STRINGCMD,		// string command
		SIGNON,			// various signondata
		TOTAL,			// must be last and is not a real group
	};

	enum {
		FLOW_OUTGOING = 0,
		FLOW_INCOMING = 1,
		MAX_FLOWS = 2
	};

	enum indices : size_t {
		GETLATENCY = 9,
		GETAVGLATENCY = 10,
		PROCESSPACKET = 41,
		SENDNETMSG = 42,
		SETCHOKED = 47,
		SENDDATAGRAM = 48,
		GETDROPNUMBER = 52,
	};

public:
	__forceinline int GetDropNumber() {
		return util::get_method< int(__thiscall*)(decltype(this)) >(this, GETDROPNUMBER)(this);
	}

	__forceinline float GetLatency(int flow) {
		return util::get_method< float(__thiscall*)(decltype(this), int) >(this, GETLATENCY)(this, flow);
	}

	__forceinline float GetAvgLatency(int flow) {
		return util::get_method< float(__thiscall*)(decltype(this), int) >(this, GETAVGLATENCY)(this, flow);
	}


	__forceinline bool SendNetMsg(void* msg, bool rel = false, bool voice = false) {
		return util::get_method< bool(__thiscall*)(decltype(this), void*, bool, bool) >(this, SENDNETMSG)(this, msg, rel, voice);
	}

	__forceinline int SendDatagram(void* data = nullptr)
	{
		return util::get_method< int(__thiscall*)(decltype(this), void*) >(this, SENDDATAGRAM)(this, data);
	}

private:
	PAD(0x14);

public:
	bool m_ProcessingMessages;		// 0x0014
	bool m_ShouldDelete;			// 0x0015
private:
	PAD(0x2);
public:
	int	m_OutSequenceNr;				// 0x0018 last send outgoing sequence number
	int	m_InSequence;				// 0x001C last received incoming sequnec number
	int	m_OutSequenceAck;			// 0x0020 last received acknowledge outgoing sequnce number
	int m_OutReliableState;			// 0x0024 state of outgoing reliable data (0/1) flip flop used for loss detection
	int	m_InReliableState;			// 0x0028 state of incoming reliable data
	int	m_ChokedPackets;			// 0x002C number of choked packets

private:
	PAD(0x414);					// 0x0030
};

class ReadBF;
class CNetMessage
{
public:
	virtual	~CNetMessage() {};

	// Use these to setup who can hear whose voice.
	// Pass in client indices (which are their ent indices - 1).

	virtual void	SetNetChannel(INetChannel* netchan) = 0; // netchannel this message is from/for
	virtual void	SetReliable(bool state) = 0;	// set to true if it's a reliable message

	virtual bool	Process(void) = 0; // calles the recently set handler to process this message

	virtual	bool	ReadFromBuffer(ReadBF& buffer) = 0; // returns true if parsing was OK
	virtual	bool	WriteToBuffer(void* buffer) = 0;	// returns true if writing was OK

	virtual bool	IsReliable(void) const = 0;  // true, if message needs reliable handling

	virtual int				GetType(void) const = 0; // returns module specific header tag eg svc_serverinfo
	virtual int				GetGroup(void) const = 0;	// returns net message group of this message
	virtual const char* GetName(void) const = 0;	// returns network message name, eg "svc_serverinfo"
	virtual INetChannel* GetNetChannel(void) const = 0;
	virtual const char* ToString(void) const = 0; // returns a human readable string about message content
};

class INetChannelInfo
{
public:

	enum
	{
		GENERIC = 0,	// must be first and is default group
		LOCALPLAYER,	// bytes for local player entity update
		OTHERPLAYERS,	// bytes for other players update
		ENTITIES,		// all other entity bytes
		SOUNDS,			// game sounds
		EVENTS,			// event messages
		TEMPENTS,		// temp entities
		USERMESSAGES,	// user messages
		ENTMESSAGES,	// entity messages
		VOICE,			// voice data
		STRINGTABLE,	// a stringtable update
		MOVE,			// client move cmds
		STRINGCMD,		// string command
		SIGNON,			// various signondata
		TOTAL,			// must be last and is not a real group
	};

	virtual const char* GetName(void) const = 0;	// get channel name
	virtual const char* GetAddress(void) const = 0; // get channel IP address as string
	virtual float		GetTime(void) const = 0;	// current net time
	virtual float		GetTimeConnected(void) const = 0;	// get connection time in seconds
	virtual int			GetBufferSize(void) const = 0;	// netchannel packet history size
	virtual int			GetDataRate(void) const = 0; // send data rate in byte/sec

	virtual bool		IsLoopback(void) const = 0;	// true if loopback channel
	virtual bool		IsTimingOut(void) const = 0;	// true if timing out
	virtual bool		IsPlayback(void) const = 0;	// true if demo playback

	virtual float		GetLatency(int flow) const = 0;	 // current latency (RTT), more accurate but jittering
	virtual float		GetAvgLatency(int flow) const = 0; // average packet latency in seconds
	virtual float		GetAvgLoss(int flow) const = 0;	 // avg packet loss[0..1]
	virtual float		GetAvgChoke(int flow) const = 0;	 // avg packet choke[0..1]
	virtual float		GetAvgData(int flow) const = 0;	 // data flow in bytes/sec
	virtual float		GetAvgPackets(int flow) const = 0; // avg packets/sec
	virtual int			GetTotalData(int flow) const = 0;	 // total flow in/out in bytes
	virtual int			GetTotalPackets(int flow) const = 0;
	virtual int			GetSequenceNr(int flow) const = 0;	// last send seq number
	virtual bool		IsValidPacket(int flow, int frame_number) const = 0; // true if packet was not lost/dropped/chocked/flushed
	virtual float		GetPacketTime(int flow, int frame_number) const = 0; // time when packet was send
	virtual int			GetPacketBytes(int flow, int frame_number, int group) const = 0; // group size of this packet
	virtual bool		GetStreamProgress(int flow, int* received, int* total) const = 0;  // TCP progress if transmitting
	virtual float		GetTimeSinceLastReceived(void) const = 0;	// get time since last recieved packet in seconds
	virtual	float		GetCommandInterpolationAmount(int flow, int frame_number) const = 0;
	virtual void		GetPacketResponseLatency(int flow, int frame_number, int* pnLatencyMsecs, int* pnChoke) const = 0;
	virtual void		GetRemoteFramerate(float* pflFrameTime, float* pflFrameTimeStdDeviation) const = 0;

	virtual float		GetTimeoutSeconds() const = 0;
};

class INetMessage {
public:
	virtual ~INetMessage() {};

	// Use these to setup who can hear whose voice.
	// Pass in client indices (which are their ent indices - 1).

	virtual void SetNetChannel(INetChannel* netchan) = 0; // netchannel this message is from/for
	virtual void SetReliable(bool state) = 0;             // set to true if it's a reliable message

	virtual bool Process(void) = 0; // calles the recently set handler to process this message

	virtual bool ReadFromBuffer(void*& buffer) = 0; // returns true if parsing was OK
	virtual bool WriteToBuffer(void*& buffer) = 0; // returns true if writing was OK

	virtual bool IsReliable(void) const = 0; // true, if message needs reliable handling

	virtual int GetType(void) const = 0;         // returns module specific header tag eg svc_serverinfo
	virtual int GetGroup(void) const = 0;        // returns net message group of this message
	virtual const char* GetName(void) const = 0; // returns network message name, eg "svc_serverinfo"
	virtual INetChannel* GetNetChannel(void) const = 0;
	virtual const char* ToString(void) const = 0; // returns a human readable string about message content
};

struct player_info_t {
	uint64_t      m_data_map;
	union {
		int64_t   m_xuid;
		struct {
			int   m_xuid_low;
			int   m_xuid_high;
		};
	};
	char          m_Name[128];
	int           m_user_id;
	char          m_guid[33];
	uint32_t      m_friends_id;
	char          m_friends_name[128];
	bool          m_fake_player;
	bool          m_is_hltv;
	uint32_t      m_custom_files[4];
	uint8_t       m_files_downloaded;
};

class CEventInfo {
public:
	enum {
		EVENT_INDEX_BITS = 8,
		EVENT_DATA_LEN_BITS = 11,
		MAX_EVENT_DATA = 192,  // ( 1<<8 bits == 256, but only using 192 below )
	};

	// 0 implies not in use
	short					m_ClassID;
	float					m_FireDelay;
	const void* m_send_table;
	const ClientClass* m_client_class;
	int						m_bits;
	uint8_t* m_data;
	int						m_Flags;
	PAD(0x18);
	CEventInfo* m_Next;
};
class CClientState {
public:
	enum indices : size_t {
		PACKETSTART = 5,
		PACKETEND = 6,
		TEMPENTITIES = 36,
	};
#ifdef LEGACY
private:
	PAD(0x9C);                                // 0x0000

public:
	INetChannel* m_NetChannel;				// 0x009C

private:
	PAD(0x70);                                // 0x00A0

public:
	int				m_next_message_time;		// 0x0110

public:
	float           m_net_cmd_time;             // 0x0114
	uint32_t        m_server_count;             // 0x0118
private:
	PAD(0x4C);								// 0x011C

public:
	int             m_unk;                      // 0x0168
	int             m_ServerTick;              // 0x016C
	int             m_ClientTick;              // 0x0170
	int             m_DeltaTick;               // 0x0174

private:
	PAD(0x4B30);                              // 0x0178

public:
	float           m_frame_time;               // 0x4CA8
	int             m_LastOutgoingCommand;    // 0x4CAC
	int             m_ChokedCommands;          // 0x4CB0
	int             m_LastCommandAck;         // 0x4CB4
	uint32_t	    m_nSoundSequence;
	PAD(0x134);                               // 0x4CB8
	CEventInfo* m_Events;					// 0x4DEC
#else
private:
	PAD(0x9C);										// 0x0000

public:
	INetChannel*		m_NetChannel;				// 0x009C
	int					m_ChallengeNr;				// 0x00A0
private:
	PAD(0x4);										//0x00A4
public:
	double				m_ConnectTime;
	int					m_RetryNumber;
private:
	PAD(84);                //0x00A4
public:
	int					m_SignonState;            //0x0108
private:
	PAD(0x4);                //0x010C
public:
	float				m_NextCmdTime;            //0x0114
	int					m_ServerCount;            //0x0118
	int					m_CurrentSequence;        //0x011C
private:
	PAD(8);
public:
	struct {
		float			m_ClockOffsets[16];
		int				m_CurClockOffset;
		int				m_ServerTick;
		int				m_ClientTick;
	} m_ClockDriftMgr;
private:
	PAD(68);
public:
	int					m_DeltaTick;                //0x0174
private:
	PAD(4);
public:
	int					m_ViewEntity;            //0x0180
	int					m_PlayerSlot;            //0x0184
	bool				m_Paused;
private:
	PAD(3);
public:
	char				m_LevelName[260];
	char				m_LevelNameShort[40];
private:
	PAD(212);                //0x032C
public:
	int					m_MaxClients;            //0x0388
private:
	PAD(18836);            //0x038C
public:
	float				m_LastServerTickTime;    //0x4D10
	bool				m_InSimulation;            //0x4D14
private:
	PAD(0xB);                //0x4D15
public:
	int					m_OldTickCount;
	float				m_TickRemainder;
	float				m_FrameTime;
	int					m_LastOutgoingCommand;
	int					m_ChokedCommands;
	int					m_LastCommandAck;
	int					m_LastServerTick;
	int					m_CommandAck;
	int					m_SoundSequence;
	int					m_LastProgressPercent;
	bool				m_IsHLTV;
private:
	PAD(75);                //0x4D38
public:
	Vector				m_ViewPoint;            //0x4D88
private:
	PAD(204);                //0x4D9A
public:
	CEventInfo*			m_Events;
#endif
};

class ISPSharedMemory;
class CGamestatsData;
class CSteamAPIContext;
struct Frustum_t;

typedef struct InputContextHandle_t__* InputContextHandle_t;
struct client_textmessage_t;
class model_t;
class SurfInfo;
class IMaterial;
class CSentence;
class CAudioSource;
class AudioState_t;
class ISpatialQuery;
class IMaterialSystem;
class CPhysCollide;
class IAchievementMgr;
class KeyValues;
class Color;
typedef void(*pfnDemoCustomDataCallback)(unsigned char* pData, size_t iSize);

class IVEngineClient {
public:
	enum indices : size_t {
		GETSCREENSIZE = 5,
		GETPLAYERINFO = 8,
		GETPLAYERFORUSERID = 9,
		GETLOCALPLAYER = 12,
		GETLASTTIMESTAMP = 14,
		GETVIEWANGLES = 18,
		SETVIEWANGLES = 19,
		//GETMAXCLIENTS          = 20,
		ISINGAME = 26,
		ISCONNECTED = 27,
		WORLDTOSCREENMATRIX = 37,
		FIREEVENTS = 59,
		GETNETCHANNELINFO = 78,
		ISPLAYINGDEMO = 82,
