#pragma once

enum LightType_t {
	MATERIAL_LIGHT_DISABLE = 0,
	MATERIAL_LIGHT_POINT,
	MATERIAL_LIGHT_DIRECTIONAL,
	MATERIAL_LIGHT_SPOT,
};

enum {
	STUDIORENDER_DRAW_ENTIRE_MODEL = 0,
	STUDIORENDER_DRAW_OPAQUE_ONLY = 0x01,
	STUDIORENDER_DRAW_TRANSLUCENT_ONLY = 0x02,
	STUDIORENDER_DRAW_GROUP_MASK = 0x03,
	STUDIORENDER_DRAW_NO_FLEXES = 0x04,
	STUDIORENDER_DRAW_STATIC_LIGHTING = 0x08,
	STUDIORENDER_DRAW_ACCURATETIME = 0x10,		// Use accurate timing when drawing the model.
	STUDIORENDER_DRAW_NO_SHADOWS = 0x20,
	STUDIORENDER_DRAW_GET_PERF_STATS = 0x40,
	STUDIORENDER_DRAW_WIREFRAME = 0x80,
	STUDIORENDER_DRAW_ITEM_BLINK = 0x100,
	STUDIORENDER_SHADOWDEPTHTEXTURE = 0x200
};

enum beam_types {
	beam_normal = 0,
	beam_disk = 2,
	beam_cylinder,
	beam_follow,
	beam_ring,
	beam_spline,
	beam_ring_point,
	beam_laser,
	beam_tesla,
};

struct LightDesc_t {
	LightType_t  m_Type;										//< MATERIAL_LIGHT_xxx
	Vector       m_Color;											//< color+intensity 
	Vector       m_Position;										//< light source center position
	Vector       m_Direction;										//< for SPOT, direction it is pointing
	float        m_Range;											//< distance range for light.0=infinite
	float        m_Falloff;										//< angular falloff exponent for spot lights
	float        m_Attenuation0;									//< constant distance falloff term
	float        m_Attenuation1;									//< linear term of falloff
	float        m_Attenuation2;									//< quadatic term of falloff
	float        m_Theta;											//< inner cone angle. no angular falloff 
	float        m_Phi;											//< outer cone angle
	float        m_ThetaDot;
	float        m_PhiDot;
	float        m_OneOverThetaDotMinusPhiDot;
	unsigned int m_Flags;
protected:
	float        m_RangeSquared;
};

class IMaterial;

struct DrawModelInfo_t {
	studiohdr_t* m_pStudioHdr;
	PAD(0x8);
	int				 m_Skin;
	int				 m_Body;
	int				 m_HitboxSet;
	void* m_pClientEntity;
	int				 m_Lod;
	void* m_pColorMeshes;
	bool			 m_bStaticLighting;
	Vector			 m_vecAmbientCube[6];
	int				 m_nLocalLightCount;
	LightDesc_t		 m_LocalLightDescs[4];
};

struct DrawModelState_t {
	studiohdr_t* m_pStudioHdr;
	studiohwdata_t* m_pStudioHWData;
	void* m_pRenderable;
	const matrix3x4_t* m_pModelToWorld;
	PAD(0x4);
	int					 m_drawFlags;
	int					 m_lod;
};

struct ModelRenderInfo_t {
	Vector				m_Origin;			// 0
	QAngle				m_angles;			// 12
	void* m_Renderable;		// 24
	const model_t* m_model;			// 28
	const matrix3x4_t* m_model_to_world;	// 32
	const matrix3x4_t* m_lighting_offset;	// 36
	const Vector* m_lighting_origin;	// 40
	int					m_Flags;			// 44
	int					m_Index;			// 48
	int					m_skin;				// 52
	int					m_LowerbodyYaw;				// 56
	int					m_hitboxset;		// 60
	uint16_t			m_instance;			// 64

	__forceinline ModelRenderInfo_t() : m_model_to_world{}, m_lighting_offset{}, m_lighting_origin{} {}
};

class ISpatialLeafEnumerator
{
public:
	virtual bool EnumerateLeaf(int leaf, int context) = 0;
};

class ISpatialQuery
{
public:
	enum indices : size_t {
		LISTLEAVESINBOX = 6,
	};

	// Returns the number of leaves
	virtual int LeafCount() const = 0;

	// Enumerates the leaves along a ray, box, etc.
	virtual bool EnumerateLeavesAtPoint(const Vector& pt, ISpatialLeafEnumerator* pEnum, int context) = 0;
	virtual bool EnumerateLeavesInBox(const Vector& mins, const Vector& maxs, ISpatialLeafEnumerator* pEnum, int context) = 0;
	virtual bool EnumerateLeavesInSphere(const Vector& center, float radius, ISpatialLeafEnumerator* pEnum, int context) = 0;
	virtual bool EnumerateLeavesAlongRay(Ray const& ray, ISpatialLeafEnumerator* pEnum, int context) = 0;
